Repository: 5l1v3r1/linkchecker
Catalog: locale/*/LC_MESSAGES/linkcheck.po
Languages: de, fr

source: Thats it.
de: Das wars.
fr: Terminé.

source: (%.3f seconds)
de: (%.3f Sekunden)

source: (cached)
de: (aus dem Cache)
fr: (caché)

source: errors
de: Fehler
fr: erreurs

source: found.
de: gefunden

source: found.
de: gefunden.

source: in %d links found
de: in %d Verweisen gefunden

source: in 1 link found
de: in 1 Verweis gefunden

source: warnings,
de: Warnungen,
fr: avertissements,

source: # Format of the entries:
de: # Format der Einträge:
fr: # Format des entrées:

source: # Get the newest version at %s
de: # Die neueste Version gibt es unter %s

source: # Stopped checking at %s (%.3f seconds)
de: # Beende Prüfen am %s (%.3f Sekunden)

source: # Write comments and bugs to %s
de: # Kommentare und Fehler mailen Sie bitte an %s

source: # created by %s at %s
de: # erstellt von %s am %s

source: %.3f seconds
de: %.3f Sekunden
fr: %.3f secondes

source: %.3f seconds
de: %.3f Sekunden
fr: %.3f secondes

source: , line
de: , Zeile
fr: , ligne

source: -- Get the newest version at %s
de: -- Die neueste Version gibt es unter %s

source: -- Stopped checking at %s (%.3f seconds)
de: -- Beende Prüfen am %s (%.3f Sekunden)

source: -- Write comments and bugs to %s
de: -- Kommentare und Fehler mailen Sie bitte an %s

source: -- created by %s at %s
de: -- erstellt von %s am %s

source: 1 error
de: 1 Fehler
fr: 1 erreur

source: 1 warning,
de: 1 Warnung,
fr: 1 avertissement,

source: Access denied by robots.txt, checked only syntax
de: Zugriff verweigert durch robots.txt; prüfe lediglich Syntax
fr: Accès refusé par robots.txt, analyse de la syntaxe seulement

source: Base
de: Basis

source: Check Time
de: Prüfzeit
fr: Durée d'Analyse

source: D/L Time
de: D/L Zeit
fr: Durée D/L

source: EXAMPLES o linkchecker -v -o html -r2 -s -i treasure.calvinsplayground.de \ http://treasure.calvinsplayground.de/~calvin/ > sample.html o Local files and syntactic sugar on the command line: linkchecker c:\temp\test.html linkchecker ../bla.html linkchecker www.myhomepage.de linkchecker -r0 ftp.linux.org
de: BEISPIELE o linkchecker -v -o html -r2 -s -i treasure.calvinsplayground.de \ http://treasure.calvinsplayground.de/~calvin/ > sample.html o Lokale Dateien und syntaktischer Zucker in der Kommandozeile: linkchecker c:\temp\test.html linkchecker ../bla.html linkchecker www.myhomepage.de linkchecker -r0 ftp.linux.org
fr: EXEMPLES o linkchecker -v -o html -r2 -s -i treasure.calvinsplayground.de \ http://treasure.calvinsplayground.de/~calvin/ > sample.html o Fichiers locaux et morceau syntaxique dans la ligne de commande: linkchecker c:\temp\test.html linkchecker ../bla.html linkchecker www.myhomepage.de linkchecker -r0 ftp.linux.org

source: Effective URL %s
de: Effektive URL %s
fr: URL effective %s

source: Error
de: Fehler
fr: Erreur

source: Error: %s
de: Fehler: %s
fr: Erreur: %s

source: Execute 'linkchecker -h' for help
de: Führen Sie 'linkchecker -h' aus um Hilfe zu erhalten
fr: Exécuter 'linkchecker -h' pour obtenir l'aide

source: Get the newest version at %s
de: Die neueste Version gibt es unter %s
fr: Obtenir la dernière version à %s

source: Got no answer from FTP server
de: Keine Antwort vom FTP Server
fr: N'obtient pas de réponse du serveur FTP

source: Group %s has %s articles, range %s to %s
de: Gruppe %s hat %s Artikel, von %s bis %s
fr: Le groupe %s a %s articles, de %s à %s

source: HTTP 301 (moved permanent) encountered: you should update this link
de: HTTP 301 (moved permanent) gefunden: Sie sollten diesen Link aktualisieren
fr: HTTP 301 (déplacé) rencontré: vous devez mettre à jour ce lien

source: HTTPS url ignored
de: HTTPS url ignoriert
fr: Url HTTPS ignorées

source: Illegal NNTP link syntax
de: Illegale NNTP link Syntax
fr: Syntaxe illégale du lien NNTP

source: Illegal argument '%s' for option
de: Ungültiges Argument '%s' für Option
fr: Argumen illégal '%s' pour l'option

source: Illegal telnet link syntax
de: Illegale telnet link Syntax
fr: Syntaxe illégale du lien telnet

source: Javascript url ignored
de: Javascript url ignoriert
fr: Url Javascript ignorée

source: Missing '/' at end of URL
de: Fehlendes '/' am Ende der URL
fr: Il manque '/' à la fin de l'URL

source: NOTES o LinkChecker assumes an http:// resp. ftp:// link when a commandline URL starts with 'www.' resp. 'ftp.' You can also give local files as arguments o If you have your system configured to automatically establish a connection to the internet (e.g. with diald), it will connect when checking links not pointing to your local host Use the -s and -i options to prevent this (see EXAMPLES) o Javascript links are currently ignored o If your platform does not support threading, LinkChecker uses -t0 o You can supply multiple user/password pairs in a configuration file o Cookies are not accepted by LinkChecker o When checking 'news:' links the given NNTP host doesn't need to be the same as the host of the user browsing your pages!
de: KOMMENTARE o LinkChecker verwendet eine http:// bzw. ftp:// URL wenn eine URL auf der Kommandozeile mit 'www.' bzw. 'ftp.' beginnt Sie können auch lokale Dateien als Argumente angeben o Falls sich Ihr System automatisch mit dem Internet verbindet (z.B. mit diald), wird es dies tun wenn Sie Links prüfen, die nicht auf Ihren lokalen Rechner verweisen Benutzen Sie die Optionen -s und -i um dies zu verhindern (siehe BEISPIELE) o Javascript Links werden zur Zeit ignoriert o Wenn Ihr System keine Threads unterstützt verwendet LinkChecker die Option -t0 o Sie können mehrere user/password Paare in einer Konfigurationsdatei angeben o Cookies werden von LinkChecker nicht akzeptiert o Beim Prüfen von 'news:' Links muß der angegebene NNTP Rechner nicht unbedingt derselbe wie der des Benutzers sein!
fr: NOTES o LinkChecker suppose qu'il s'agit de liens http:// et respectivement ftp:// lorsque l'URL de la ligne de commande commence par 'www.' et respectivement 'ftp.' Vous pouvez aussi donner des fichiers locaux comme arguments o Si votre systeme est configuré pour établir automatiquement une connexion à internet (e.g. with diald), il se connectera lorsque les liens contrôlés ne pointent pas vers votre réseau local Utiliser l'option -s et -i pour l'éviter (voir EXEMPLES) o Les liens Javascript sont actuellement ignorés o If your platform does not support threading, LinkChecker uses -t0 o Vous pouvez fournir plusieurs couples 'utilisateurs'/'mots de passe' dans le fichier de configuration o Les cookies ne sont pas acceptés par LinkChecker o Lors d'un contrôle des liens 'news:', l'hôte NNTP spécifié n'a pas besoin d'être le même que l'hôte de l'utilisateur qui parcourt vos pages!

source: No NNTP server specified, checked only syntax
de: Kein NNTP Server angegeben; prüfe lediglich Syntax
fr: Auncun serveur NNTP spécifié, analyse de la syntaxe seulement

source: No adresses found
de: Keine Adressen gefunden
fr: Aucune adresse trouvée

source: None of the mail hosts for %s accepts an SMTP connection: %s
de: Keiner der Mail Hosts für %s akzeptiert eine SMTP Verbindung: %s
fr: Aucun des hôtes de messagerie pour %s n'accepte de connection SMTP: %s

source: Parent URL
de: Vater URL
fr: URL Parente

source: Real URL
de: Tats. URL
fr: URL Réelle

source: Result
de: Ergebnis
fr: Résultat

source: Start checking at %s
de: Beginne Prüfen am %s
fr: Démarrage du controle à %s

source: Stopped checking at %s (%.3f seconds)
de: Beende Prüfen am %s (%.3f Sekunden)

source: Thats it.
de: Das wars.

source: URL is null or empty
de: URL ist Null oder leer
fr: L'URL est nulle ou vide

source: USAGE linkchecker [options] file_or_url... OPTIONS -a, --anchors Check anchor references. Default is don't check anchors. -D, --debug Print additional debugging information. -e regex, --extern=regex Assume urls that match the given expression as extern. Only intern HTTP links are checked recursively. -f file, --config=file Use file as configuration file. LinkChecker first searches ~/.linkcheckerrc and then /etc/linkcheckerrc (under Windows <path-to-program>\linkcheckerrc). -F name, --file-output=name Same as output, but write to a file linkchecker-out.<name>. If the file already exists, it is overwritten. You can specify this option more than once. There is no file output for the blacklist logger. Default is no file output. -i regex, --intern=regex Assume urls that match the given expression as intern. -h, --help Help me! Print usage information for this program. -l, --allowdeny Swap checking order to intern/extern. Default checking order is extern/intern. -N, --nntp-server Specify an NNTP server for 'news:...' links. Default is the environment variable NNTP_SERVER. If no host is given, only the syntax of the link is checked. -o name, --output=name Specify output as %s. Default is text. -p pwd, --password=pwd Try given password for HTML and FTP authorization. Default is 'guest@'. See -u. -P host[:port], --proxy=host[:port] Use specified proxy for HTTP requests. Standard port is 8080. Default is to use no proxy. -q, --quiet Quiet operation. This is only useful with -F. -r depth, --recursion-level=depth Check recursively all links up to given depth (depth >= 0). Default depth is 1. -R, --robots-txt Obey the robots exclusion standard. -s, --strict Check only syntax of extern links, do not try to connect to them. -t num, --threads=num Generate no more than num threads. Default number of threads is 5. To disable threading specify a non-positive number. -u name, --user=name Try given username for HTML and FTP authorization. Default is 'anonymous'. See -p. -V, --version Print version and exit. -v, --verbose Log all checked URLs (implies -w). Default is to log only invalid URLs. -w, --warnings Log warnings. -W regex, --warning-regex=regex Define a regular expression which prints a warning if it matches any content of the checked link. This applies of course only to pages which are valid, so we can get their content. You can use this to check for pages that contain some form of error message, for example 'This page has moved' or 'Oracle Application Server error'. This option implies -w.
de: BENUTZUNG linkchecker [options] datei_oder_url... OPTIONEN -a, --anchors Prüfe interne Verweise. Standard ist keine Prüfung. -D, --debug Drucke zusätzlich Debug Information. -e regex, --extern=regex Behandle URLs welche diesen Ausdruck matchen als extern. Nur interne HTTP Links werden rekursiv geprüft. -f file, --config=file Benutze file als Konfigurationsdatei. LinkChecker sucht zuerst ~/.linkcheckerrc und dann /etc/linkcheckerrc (unter Windows <Pfad-zum-Programm>\linkcheckerrc). -F name, --file-output=name Wie --output, aber schreibe in eine Datei (Standard ist linkchecker-out.<name>) Falls die Datei bereits existiert wird sie überschrieben. Sie können diese Option mehr als einmal verwenden. Es gibt keine Ausgabedatei für den blacklist Logger. Standard ist keine Ausgabe in eine Datei. -i regex, --intern=regex Behandle URLs welche diese Ausdruck matchen als intern. -h, --help Hilf mir! Druche Nutzungsinformation für dieses Programm. -l, --allowdeny Vertausche die Prüfreihenfolge zu intern/extern. Standardmäßige Reihenfolge ist extern/intern. -N, --nntp-server Gibt ein NNTP Rechner für 'news:...' Links. Standard ist die Umgebungsvariable NNTP_SERVER. Falls kein Rechner angegeben ist, wird lediglich auf korrekte Syntax des Links geprüft. -o name, --output=name Verwende die Ausgabe %s. Standard ist text. -p pwd, --password=pwd Verwende das angegebene Passwort für HTML und FTP Authorisation. Standard ist 'guest@'. Siehe -u. -P host[:port], --proxy=host[:port] Verwende den angegebenen Proxy für HTTP Anfragen. Standard Port ist 8080. Standard ist keine Verwendung eines Proxy. -q, --quiet Keine Ausgabe. Dies ist nur in Verbindung mit -F nützlich. -r depth, --recursion-level=depth Prüfe rekursiv alle Verweise bis zu der angegebenen Tiefe (depth >= 0). Standard Tiefe ist 1. -R, --robots-txt Befolge den Robots Exclusion Standard. -s, --strict Prüfe lediglich die Syntax von externen Verweisen. Es wird keine. Verbindung zu diesen Rechner aufgebaut. -t num, --threads=num Generiere nicht mehr als num Threads. Standard Anzahl von Threads ist 5. Um Threading auszuschalten geben Sie eine nichtpositive Anzahl an. -u name, --user=name Verwende den angegebenen Benutzernamen für HTML und FTP Authorisation. Standard ist 'anonymous'. Siehe -p. -V, --version Drucke die Version und beende das Programm. -v, --verbose Logge alle geprüften URLs (nimmt -w an). Standard ist es, nur fehlerhafte URLs zu loggen. -w, --warnings Logge Warnungen. -W regex, --warning-regex=regex Definieren Sie einen regulären Ausdruck, der eine Warnung ausdruckt falls er den Inhalt eines geprüften Verweises matcht. Dies gilt natürlich nur für gültige Seiten deren Inhalt wir bekommen können. Sie können dies verwenden, um Seiten mit Fehlermeldungen wie z.B. 'Diese Seite ist umgezogen' oder 'Oracle Server Fehler'. Diese Option nimmt -w an.
fr: USAGE linkchecker [options] fichier_ou_url... OPTIONS -a, --anchors Contrôle les références ancrées. Par défaut, il ne les contrôle pas. -D, --debug Affiche des informations de débugage supplémentaires. -e regex, --extern=regex Assume urls that match the given expression as extern. Only intern HTTP links are checked recursively. -f file, --config=file Utilise le fichier comme fichier de configuration. LinkChecker recherche d'abord ~/.linkcheckerrc puis /etc/linkcheckerrc (sous Windows <chemin-vers-le-programe>\linkcheckerrc). -F name, --file-output=name Identique à output, mais écrit dans un fichier linkchecker-out.<nom>. Si le fichier existe, il sera écrasé. Vous pouvez spécifier cette option plus d'une fois. Il n'y a pas de fichier de sotie pour les logs de la liste noire. Par défaut, il n'y a pas de fichier de sortie. -i regex, --intern=regex Assume urls that match the given expression as intern. -h, --help Aide moi! Affiche les informations d'utilisation pour ce programme. -l, --allowdeny Swap checking order to intern/extern. Default checking order is extern/intern. -N, --nntp-server Specify an NNTP server for 'news:...' links. Default is the environment variable NNTP_SERVER. If no host is given, only the syntax of the link is checked. -o name, --output=name Specify output as %s. Default is text. -p pwd, --password=pwd Try given password for HTML and FTP authorization. Default is 'guest@'. See -u. -P host[:port], --proxy=host[:port] Use specified proxy for HTTP requests. Standard port is 8080. Default is to use no proxy. -q, --quiet Quiet operation. This is only useful with -F. -r depth, --recursion-level=depth Check recursively all links up to given depth (depth >= 0). Default depth is 1. -R, --robots-txt Obey the robots exclusion standard. -s, --strict Contrôle seulement la syntaxe des liens externes, et ne pas essayer de s'y connecter. -t num, --threads=num Generate no more than num threads. Default number of threads is 5. To disable threading specify a non-positive number. -u name, --user=name Essayer le nom d'utilisateur donné pour l'autorisation HTTP et FTP. La valeur par défaut est 'anonymous'. Regarder à -p. -V, --version Affiche la version et quitte. -v, --verbose Logger toutes les URLs contôlées (suppose -w). Par défaut, seulement les URLS invalides sont logguées. -w, --warnings Logger les avertissements. -W regex, --warning-regex=regex Define a regular expression which prints a warning if it matches any content of the checked link. This applies of course only to pages which are valid, so we can get their content. You can use this to check for pages that contain some form of error message, for example 'This page has moved' or 'Oracle Application Server error'. This option implies -w.

source: Valid
de: Gültig
fr: Valide

source: Warning
de: Warnung
fr: Avertissement

source: Write comments and bugs to %s
de: Kommentare und Fehler mailen Sie bitte an %s

source: Write comments and bugs to %s
de: Kommentare und Fehler schreiben Sie bitte an %s
fr: Ecrire les commentaires et rapport de bug à %s

source: could not split the mail adress
de: konnte Mail Adresse nicht splitten
fr: impossible de partager l'adresse e-mail

source: found
de: gefunden
fr: trouvé

source: found mail host %s
de: Mail host %s gefunden
fr: trouvé un hôte de messagerie %s

source: illegal recursionlevel number %d
de: illegale recursionlevel Nummer %d
fr: valeur du niveau de récursivité %d illégal

source: invalid log option '%s'
de: ungültige Log Option '%s'
fr: option de log invalide '%'

source: outside of domain filter, checked only syntax
de: außerhalb des Domain Filters; prüfe lediglich Syntax
fr: outside of domain filter, analyse de la syntaxe seulement

source: robots.txt:%d: allow without user agents
de: robots.txt:%d: allow ohne user agents

source: robots.txt:%d: disallow without user agents
de: robots.txt:%d: disallow ohne user agents

source: robots.txt:%d: user-agent in the middle of rules
de: robots.txt:%d: user-agent zwischen Regeln

source: warning: no files or urls given
de: Warnung: keine Dateien oder URLs angegeben
fr: attention: aucun fichier ou url donnée

source: found
fr: trouvé

source: in %d links
fr: dans %d liens

source: in 1 link
fr: dans 1 liens

source: No user or password found
fr: Aucun utilisateur ou mot de passe trouvé

source: Stopped checking at %s
fr: Arrêt du controle à %s

source: hours
fr: heures

source: seconds
fr: secondes
