Repository: 5l1v3r1/linkchecker
Catalog: doc/*.po
Languages: fr

source: 10 March 2001
fr: 10 mars 2001

source: NAME
fr: NOM

source: linkchecker - check HTML documents for broken links
fr: linkchecker - outil permettant de vérifier s'il n'y a pas de liens cassés dans les documents HTML

source: B<linkchecker> [ I<options> ] [ I<file-or-url> ]
fr: B<linkchecker> [ I<options> ] [ I<fichier-ou-url> ]

source: LinkChecker features recursive checking, multithreading, output in colored or normal text, HTML, SQL, CSV or a sitemap graph in GML or XML, support for HTTP/1.1, HTTPS, FTP, mailto:, news:, nntp:, Gopher, Telnet and local file links, restriction of link checking with regular expression filters for URLs, proxy support, username/password authorization for HTTP and FTP, robots.txt exclusion protocol support, i18n support, a command line interface and a (Fast)CGI web interface (requires HTTP server)
fr: LinkChecker propose une vérification récursive, du multithreading, un affichage en couleurs ou au format texte, HTML, SQL, CSV, mais aussi un graphique de la carte du site en GML ou XML, un support de HTTP/1.1, HTTPS, FTP, mailto:, news:, nntp:, Gopher, Telnet et les liens sur les fichiers locaux, une vérification des liens restreinte par l'utilisation de filtres à base d'expressions rationnelles, un support des proxys, des autorisations nom utilisateur/mot de passe pour HTTP et FTP, un support du protocole d'exclusion par le fichier robots.txt,un support de l'internationalisation, une interface ligne de commandes et une interface web CGI (rapide, qui nécessite un serveur HTTP).

source: EXAMPLES
fr: EXEMPLES

source: The most common use checks the given domain recursively, plus any single URL pointing outside of the domain: B<linkchecker http://treasure.calvinsplayground.de/>
fr: L'utilisation la plus courante est de vérifier le domaine récursivement, ainsi que quelques URL simples pointant en dehors du domaine : B<linkchecker http://treasure.calvinsplayground.de/>

source: Beware that this checks the whole site which can have several hundred thousands URLs. Use the -r option to restrict the recursion depth.
fr: Faites attention, car ceci vérifie le site en entier, celui-ci pouvant avoir plusieurs centaines de milliers d'URL. Utilisez l'option B<-r> pour restreindre la profondeur de la récursion.

source: Checking a local HTML file on Unix: B<linkchecker ../bla.html>
fr: Pour vérifier un fichier HTML local sur Unix : B<linkchecker ../bla.html>

source: Checking a local HTML file on Windows: B<linkchecker c:\etemp\etest.html>
fr: Pour vérifier un fichier HTML local sur Windows : B<linkchecker c:\etemp\etest.html>

source: You can skip the B<http://> url part if the domain starts with B<www.>: B<linkchecker www.myhomepage.de>
fr: Vous pouvez ne pas mettre la partie B<http://> de l'URL si le nom de domaine commence par B<www.> : B<linkchecker www.myhomepage.de>

source: You can skip the B<ftp://> url part if the domain starts with B<ftp.>: B<linkchecker -r0 ftp.linux.org>
fr: Vous pouvez ne pas mettre la partie B<ftp://> de l'URL si le nom de domaine commence par B<ftp.> : B<linkchecker -r0 ftp.linux.org>

source: General options
fr: Options générales

source: Help me! Print usage information for this program.
fr: Afficher des informations sur l'utilisation du programme.

source: Use I<configfile> as configuration file. As default LinkChecker first searches B</etc/linkchecker/linkcheckerrc> and then B<~/.linkchecker/linkcheckerrc>.
fr: Utiliser I<configfile> comme fichier de configuration. LinkChecker recherche d'abord B</etc/linkchecker/linkcheckerrc> puis B<~/.linkchecker/linkcheckerrc>.

source: Ask for url if none are given on the commandline.
fr: Demander l'URL si aucune n'a été donnée sur la ligne de commande.

source: Print version and exit.
fr: Afficher la version et quitter.

source: Generate no more than I<num> threads. Default number of threads is 10. To disable threading specify a non-positive number.
fr: Permettre de ne pas avoir plus de I<num> threads. Le nombre de threads est fixé par défaut à 10.Pour désactiver le multithreading, spécifier un nombre non positif.

source: Output options
fr: Options de sortie

source: Log all checked URLs (implies B<-w>). Default is to log only invalid URLs.
fr: Journaliser toutes les URL vérifiées (implique B<-w>). Par défaut, seules les URL invalides sont mises dans le journal.

source: Log warnings.
fr: Journaliser les avertissements.

source: Define a regular expression which prints a warning if it matches any content of the checked link. This applies of course only to pages which are valid, so we can get their content. Use this to check for pages that contain some form of error, for example "This page has moved" or "Oracle Application Server error". This option implies B<-w>.
fr: Définir une expression rationnelle. Quand cette expression rationnelle correspondra au contenu d'un lien vérifié, LinkChecker affichera un avertissement.Ceci ne s'applique qu'aux pages valides, car on peut ainsi récupérer leur contenu.Utilisez ceci afin de vérifier les pages qui peuvent contenir des messages d'erreur sous une certaine forme, comme par exemple "Cette page a été déplacée" ou "Erreur du serveur d'application Oracle".Cette option implique B<-w>.

source: Print a warning if content size is available and exceeds the given number of I<bytes>. This option implies B<-w>.
fr: Affiche un avertissement si la taille du contenu disponible dépasse le nombre d'I<octets> donné.Cette option implique B<-w>.

source: Quiet operation, an alias for B<-o none>. This is only useful with B<-F>.
fr: Exécution silencieuse, c'est un alias pour B<-o none>. Cette option n'est utile qu'avec B<-F>.

source: B<-o>I<type>[B</>I<encoding>], B<--output=>I<type>[B</>I<encoding>]
fr: B<-o>I<type>[B</>I<encodage>], B<--output=>I<type>[B</>I<encodage>]

source: B<-F>I<type>[B</>I<encoding>][B</>I<filename>], B<--file-output=>I<type>[B</>I<encoding>][B</>I<filename>]
fr: B<-F>I<type>[B</>I<encodage>][B</>I<nom_fichier>], B<--file-output=>I<type>[B</>I<encodage>][B</>I<nom_fichier>]

source: Do not print check status messages.
fr: Ne pas afficher les messages d'état de la vérification.

source: Print debugging output for given logger. Available loggers are B<cmdline>, B<checking>, B<cache>, B<gui> and B<all>. Specifying B<all> is an alias for specifying all available loggers. The option can be given multiple times to debug with more than one logger. For accurate results, threading will be disabled during debug runs.
fr: Afficher les sorties de débogage pour l'enregistreur de journal I<logger>. Les enregistreurs disponibles sont : B<cmdline>, B<checking>, B<cache>, B<gui> and B<all>. B<all> est un alias pour indiquer que l'on veut tous les enregistreurs disponibles. Cette option peut être donnée plusieurs fois pour déboguer avec plus d'un enregistreur de journal. Le multithreading est désactivé pendant une exécution en mode debug afin de garantir la précision des résultats.

source: Write profiling data into a file named B<linkchecker.prof> in the current working directory. See also B<--viewprof>.
fr: Écrire les données de profilage dans un fichier nommé B<linkchecker.prof> dans le répertoire de travail courant. Voir aussi B<--viewprof>.

source: Print out previously generated profiling data. See also B<--profile>.
fr: Afficher en sortie les données de profilage générées précédemment. Voir aussi B<--profile>.

source: Checking options
fr: Options de vérification

source: B<-r>I<depth>, B<--recursion-level=>I<depth>
fr: B<-r>I<profondeur>, B<--recursion-level=>I<profondeur>

source: Check recursively all links up to given I<depth>. A negative depth will enable inifinite recursion. Default depth is inifinite.
fr: Vérifier récursivement tous les liens jusqu'à une I<rofondeur>donnée. Une profondeur négative permet d'avoir une récursion infinie. Par défaut, la récursion est infinie.

source: Accept and send HTTP cookies according to RFC 2109. Only cookies which are sent back to the originating server are accepted. Sent and accepted cookies are provided as additional logging information.
fr: Accepter et envoyer des cookies HTTP en accord avec le RFC 2109. Seuls les cookies qui sont renvoyés au serveur d'origine sont acceptés. Les cookies acceptés et envoyés sont fournis comme une information supplémentaire dans les journaux.

source: Treat url#anchora and url#anchorb as equal on caching. This is the default browser behaviour, but it's not specified in the URI specification. Use with care.
fr: Traiter url#anchora et url#anchorb comme égales dans le cache. Ceci est le comportement par défaut d'un navigateur, mais n'est pas spécifié dans la spécification URI. À utiliser avec précaution.

source: B<-u>I<name>, B<--user=>I<name>
fr: B<-u>I<nom>, B<--user=>I<nom>

source: Try username I<name> for HTTP and FTP authorization. For FTP the default username is B<anonymous>. See also B<-p>.
fr: Essayer le nom d'utilisateur I<nom> pour l'autorisation HTTP et FTP. Pour FTP, le nom d'utilisateur par défaut est B<anonymous>. Voir aussi B<-p>.

source: Try the password I<pwd> for HTTP and FTP authorization. For FTP the default password is B<anonymous@>. See also B<-u>.
fr: Essayer le mot de passe I<pwd> pour l'autorisation HTTP et FTP. Pour FTP, le mot de passe par défaut est B<anonymous@>. Voir aussi B<-u>.

source: Set the timeout for connection attempts in seconds. The default timeout is 30 seconds.
fr: Préciser le délai d'expiration pour les attentes de connexion en secondes. Le délai par défaut est de 30 secondes.

source: Pause I<secs> seconds between each url check. This option implies B<-t0>. Default is no pause between requests.
fr: Mettre en pause I<secs> secondes entre chaque vérification d'URL. Cette option implique B<-t0>. Par défaut, il n'y a pas de pause entre les requêtes.

source: B<-N>I<server>, B<--nntp-server=>I<server>
fr: B<-N>I<serveur>, B<--nntp-server=>I<serveur>

source: Specify an NNTP server for B<news:> links. Default is the environment variable B<NNTP_SERVER>. If no host is given, only the syntax of the link is checked.
fr: Spécifier un serveur NNTP pour les liens « news: ». Par défaut, la variable d'environnement B<NNTP_SERVER> est utilisée. Si aucun hôte n'est donné, LinkChecker n'effectue qu'une vérification de la syntaxe du lien.

source: Deprecated options
fr: Options obsolètes

source: Print check status every 5 seconds to stderr. This is the default now.
fr: Afficher l'état des vérifications toutes les 5 secondes sur la sortie d'erreur. C'est le comportement par défaut.

source: Note that by default only errors are logged.
fr: Notez que seules les erreurs sont journalisées par défaut.

source: Standard text logger, logging URLs in keyword: argument fashion.
fr: Sortie texte standard, journaliser les URL dans des mots clés : mode argument.

source: Log URLs in keyword: argument fashion, formatted as HTML. Additionally has links to the referenced pages. Invalid URLs have HTML and CSS syntax check links appended.
fr: Journaliser les URL dans des mots clés : mode argument, formaté en HTML. Contient aussi des liens vers les pages référencées. Les URL invalides ont aussi en plus une vérification syntaxique des liens HTML et CSS.

source: Log check result in CSV format with one URL per line.
fr: Journaliser le résultat de la vérification au format CSV avec une URL par ligne.

source: Log parent-child relations between linked URLs as a GML graph. You should use the B<--verbose> option to get a complete graph.
fr: Journaliser les relations fils/père entre les URL liées dans un graphe GML. Vous devez utiliser l'option B<--verbose> pour avoir un graphe complet.

source: Log parent-child relations between linked URLs as a DOT graph. You should use the B<--verbose> option to get a complete graph.
fr: Journaliser les relations fils/père entre les URL liées dans un graphe DOT. Vous devez utiliser l'option B<--verbose> pour avoir un graphe complet.

source: Log check result as machine-readable XML file.
fr: Journaliser le résultat de la vérification dans un fichier au format XML.

source: Log check result as SQL script with INSERT commands. An example script to create the initial SQL table is included as create.sql.
fr: Journaliser le résultat dans un script SQL avec des commandes INSERT. Un script d'exemple montrant la création de la table SQL initiale est inclus : create.sql.

source: Logs nothing. Suitable for scripts.
fr: Ne rien journaliser du tout. Approprié pour les scripts.

source: A B<!> before any regex negates it. So B<!^mailto:> matches everything but a mailto link.
fr: Un B<!> avant une expression rationnelle l'inverse. Ainsi B<!^mailto:> correspond à tout sauf un lien mailto.

source: LinkCheckers commandline parser treats B<ftp.> links like B<ftp://ftp.> and B<www.> links like B<http://www.>. You can also give local files as arguments.
fr: Les URL sur la ligne de commande commençant par B<ftp.> sont traitées comme B<ftp://ftp.>, les URL commençant par B<www.> sont traitées comme B<http://www.>. Vous pouvez aussi mettre des noms de fichiers locaux comme arguments.

source: If you have your system configured to automatically establish a connection to the internet (e.g. with diald), it will connect when checking links not pointing to your local host. Use the B<-s> and B<-i> options to prevent this.
fr: Si votre système est configuré pour établir automatiquement une connexion à internet (par exemple, avec diald), il se connectera quand les liens de vérification ne pointent pas sur votre système local. Utilisez les options B<-s> et B<-i> pour éviter cela.

source: Javascript links are currently ignored.
fr: Les liens javascript sont ignorés actuellement.

source: If your platform does not support threading, LinkChecker uses B<-t0>.
fr: Si votre plate-forme n'accepte pas le multithreading, LinkChecker utilise B<-t0>.

source: You can supply multiple user/password pairs in a configuration file.
fr: Vous pouvez fournir plusieurs paires nom d'utilisateur/mot de passe dans un fichier de configuration.

source: To use proxies set $http_proxy, $https_proxy on Unix or Windows. On a Mac use the Internet Config.
fr: Pour utiliser les proxys, positionnez $http_proxy, $https_proxy sur Unix ou Windows.Sur un Mac, utilisez la configuration Internet.

source: When checking B<news:> links the given NNTP host doesn't need to be the same as the host of the user browsing your pages.
fr: Pour la vérification des liens B<news:>, les liens de l'hôte NNTP donné n'ont pas besoin d'être les mêmes que l'hôte de l'utilisateur naviguant.

source: ENVIRONMENT
fr: ENVIRONNEMENT

source: B<NNTP_SERVER> - specifies default NNTP server
fr: B<NNTP_SERVER> - spécifie le serveur NNTP par défaut

source: B<http_proxy> - specifies default HTTP proxy server
fr: B<http_proxy> - spécifie le proxy HTTP par défaut

source: B<ftp_proxy> - specifies default FTP proxy server
fr: B<ftp_proxy> - spécifie le proxy FTP par défaut

source: B<LC_MESSAGES>, B<LANG>, B<LANGUAGE> - specify output language
fr: B<LC_MESSAGES>, B<LANG>, B<LANGUAGE> - spécifie la langue en sortie

source: The return value is non-zero when
fr: Le code de retour est différent de 0 quand

source: invalid links were found or
fr: il y a eu des liens non valides,

source: link warnings were found and --warnings option was given
fr: il y a eu des avertissements sur les liens et l'option --warnings était positionnée,

source: a program error occurred.
fr: il y a eu une erreur dans le programme.

source: FILES
fr: FICHIERS

source: B</etc/linkchecker/linkcheckerrc>, B<~/.linkchecker/linkcheckerrc> - default configuration files
fr: B</etc/linkchecker/linkcheckerrc>, B<~/.linkchecker/linkcheckerrc> - fichiers de configuration par défaut

source: B<~/.linkchecker/blacklist> - default blacklist logger output filename
fr: B<~/.linkchecker/blacklist> - fichier par défaut des blacklists pour la journalisation

source: B<linkchecker-out.>I<type> - default logger file output name
fr: B<linkchecker-out.>I<type> - fichier par défaut pour la journalisation

source: B<http://docs.python.org/lib/standard-encodings.html> - valid output encodings
fr: B<http://docs.python.org/lib/standard-encodings.html> - encodages valides de sortie

source: AUTHOR
fr: AUTEUR

source: Bastian Kleineidam E<lt>calvin@users.sourceforge.netE<gt>
fr: Bastian Kleineidam E<lt>calvin@users.sourceforge.netE<gt> Ce document est une traduction, réalisée par Yann Verley E<lt>yann.verley@free.fr<gt> le 29 novembre 2004. L'équipe de traduction a fait le maximum pour réaliser une adaptation française de qualité. La version anglaise la plus à jour de ce document est toujours consultable via la commande : LANGUAGE=en man linkchecker N'hésitez pas à signaler à l'auteur ou au traducteur, selon le cas, toute erreur dans cette page de manuel.
