Repository: 5l1v3r1/linkchecker
Catalog: po/*.po
Languages: nl

source: Warning: %s
nl: Waarschuwing: %s

source: Error: %s
nl: Fout: %s

source: invalid log option '%s'
nl: ungeldige Log Optie '%s'

source: illegal recursionlevel number %d
nl: illegaal recursie nivo nummer %d

source: No user or password found
nl: Geen gebruikernaam of wachtwoord gevonden

source: Remote host has closed connection
nl: Remote host heeft de verbinding beëindigd

source: Got no answer from FTP server
nl: Geen antwoord van FTP Server

source: found
nl: gevonden

source: Access denied by robots.txt, checked only syntax
nl: Toegang geweigerd door robots.txt; alleen syntax gecontroleerd

source: too much redirections (>= 5)
nl: te veel verwijzingen (>= 5)

source: Server does not support HEAD request (got %d status), falling back to GET
nl: Server understeunt geen HEAD verzoek (kreeg status %d), probeer GET

source: Netscape Enterprise Server with no HEAD support, falling back to GET
nl: Netscape Enterprise Server zonder HEAD ondersteuning, probeer GET

source: Zope Server cannot determine MIME type with HEAD, falling back to GET
nl: Zope Server understeunt geen HEAD verzoek, probeer GET

source: Effective URL %s
nl: Effektieve URL %s

source: HTTP 301 (moved permanent) encountered: you should update this link
nl: HTTP 301 (moved permanent) gevonden: u moet deze verwijzing vernieuwen

source: A HTTP 301 redirection occured and the url has no trailing / at the end. All urls which point to (home) directories should end with a / to avoid redirection
nl: Es trat eine HTTP 301 Weiterleitung auf und die URL endet nicht mit /. Alle URLs, die auf (Home-) Verzeichnisse verweisen, sollten mit einem / enden, um Weiterleitungen zu verhindern

source: No adresses found
nl: Geen adres gevonden

source: No MX mail host for %s found
nl: Geen Mail host %s gevonden

source: Verified adress: %s
nl: Geldig adres: %s

source: None of the MX mail hosts for %s accepts an SMTP connection: %s
nl: Geen van de mail hosts %s accepteert een SMTP Verbinding: %s

source: found MX mail host %s
nl: Mail host %s gevonden

source: could not split the mail adress
nl: kon Mail adres niet splitsen

source: No NNTP server specified, skipping this URL
nl: Geen NNTP server gegeven; URL overgeslagen

source: Articel number %s found
nl: Artikel nummer %s niet gevonden

source: Group %s has %s articles, range %s to %s
nl: Groep %s heeft %s artikelen, van %s tot %s

source: No newsgroup specified in NNTP URL
nl: Geen nieuwsgroep in de NNTP URL gespecificeerd

source: Illegal telnet link syntax
nl: Illegale Telnet link Syntax

source: Error
nl: Fout

source: Valid
nl: Geldig

source: URL is null or empty
nl: URL is nul of leeg

source: outside of domain filter, checked only syntax
nl: buiten het domein filter, alleen syntax gecontroleerd

source: <html><head> <title>LinkChecker Online Error</title></head> <body text=#192c83 bgcolor=#fff7e5 link=#191c83 vlink=#191c83 alink=#191c83> <blockquote> <b>Error</b><br> The LinkChecker Online script has encountered an error. Please ensure that your provided URL link begins with <code>http://</code> and contains only these characters: <code>A-Za-z0-9./_~-</code><br><br> Errors are logged. </blockquote> </body> </html>
nl: <html><head><title>LinkChecker Online Fehler</title></head><body text="#192c83" bgcolor="#fff7e5" link="#191c83" vlink="#191c83"alink="#191c83"><blockquote><b>Fehler</b><br>Das LinkChecker Online Skript ist auf einen Fehler gesto&szlig;en. Bitte stellen Sie sicher, da&szlig; die angegebene URL mit <code>http://</code> beginnt und nur diese Zeichen enth&auml;lt: <code>A-Za-z0-9./_~-</code><br><br>Fehler werden geloggt. </blockquote></body></html>

source: created by %s at %s
nl: gemaakt door %s om %s

source: Get the newest version at %s
nl: Haal de nieuwste versie op van %s

source: Write comments and bugs to %s
nl: Stuur commentaar en bugs aan %s

source: # Format of the entries:
nl: # Format der Einträge:

source: seconds
nl: Seconden

source: Stopped checking at %s
nl: Stop testen om %s

source: minutes
nl: minuten

source: hours
nl: Uren

source: Parent URL
nl: Ouder URL

source: , line %d
nl: , regel %d

source: (cached)
nl: (uit de cache)

source: Name
nl: Naam

source: Base
nl: Basis

source: Real URL
nl: Echte URL

source: D/L Time
nl: D/L Zeit

source: %.3f seconds
nl: %.3f Seconden

source: Check Time
nl: Testtijd

source: Warning
nl: Waarschuwing

source: Result
nl: Resultaat

source: Start checking at %s
nl: Begin testen vanaf %s

source: Thats it.
nl: Dat was het.

source: 1 error
nl: 1 fout

source: errors
nl: fouten

source: in 1 link
nl: in 1 URL

source: in %d links
nl: in %d URLs

source: found
nl: gevonden

source: name
nl: Naam

source: parenturl
nl: ouder URL

source: base
nl: basis

source: realurl
nl: echte URL

source: dltime
nl: D/L tijd

source: %.3f seconds
nl: %.3f Seconden

source: checktime
nl: Testtijd

source: warning
nl: Waarschuwing

source: result
nl: resultaat

source: Thats it.
nl: Dat was het.

source: found
nl: gevonden

source: USAGE linkchecker [options] file-or-url... OPTIONS For single-letter option arguments the space is not a necessity. So '-o colored' is the same as '-ocolored'. -a, --anchors Check HTTP anchor references. Default is don't check anchors. -C, --cookies Accept and send HTTP cookies according to RFC 2109. Only cookies which are sent back to the originating server are accepted. Sent and accepted cookies are provided as additional logging information. -d, --denyallow Swap checking order to extern/intern. Default checking order is intern/extern. -D, --debug Print debugging information. Provide this option multiple times for even more debugging information. -e regex, --extern=regex Assume urls that match the given expression as extern. Only intern HTML links are checked recursively. -f file, --config=file Use file as configuration file. As default LinkChecker first searches /etc/linkcheckerrc and then ~/.linkcheckerrc (under Windows <path-to-program>\linkcheckerrc). -F type[/filename], --file-output=type[/filename] Same as -o, but write to a file linkchecker-out.<type> or <filename> if specified. If the file already exists, it is overwritten. You can specify this option more than once. There is no file output for the blacklist logger. Default is no file output. -I, --interactive Ask for url if none are given on the commandline. -i regex, --intern=regex Assume URLs that match the given expression as intern. LinkChecker descends recursively only to intern URLs, not to extern. -h, --help Help me! Print usage information for this program. -N server, --nntp-server=server Specify an NNTP server for 'news:...' links. Default is the environment variable NNTP_SERVER. If no host is given, only the syntax of the link is checked. -o type, --output=type Specify output type as %s. Default type is text. -p pwd, --password=pwd Try password pwd for HTTP and FTP authorization. Default password is 'joe@'. See also -u. -P secs, --pause=secs Pause <secs> seconds between each url check. This option implies -t0. Default is no pause between requests. --profile Write profiling data into a file named %s in the current working directory. See also --viewprof. -q, --quiet Quiet operation. This is only useful with -F. -r depth, --recursion-level=depth Check recursively all links up to given depth (depth >= 0). Default depth is 1. -s, --strict Check only syntax of extern links, do not try to connect to them. -t num, --threads=num Generate no more than num threads. Default number of threads is 5. To disable threading specify a non-positive number. --timeout=secs Set the timeout for TCP connection attempts in seconds. The default timeout is 10 seconds. -u name, --user=name Try username name for HTTP and FTP authorization. Default is 'anonymous'. See also -p. -V, --version Print version and exit. -v, --verbose Log all checked URLs (implies -w). Default is to log only invalid URLs. --viewprof Print out previously generated profiling data. See also --profile. -w, --warnings Log warnings. -W regex, --warning-regex=regex Define a regular expression which prints a warning if it matches any content of the checked link. This applies of course only to pages which are valid, so we can get their content. Use this to check for pages that contain some form of error message, for example 'This page has moved' or 'Oracle Application Server error'. This option implies -w.
nl: GEBRUIK linkchecker [options] bestand_of_url... OPTIES -a, --anchors Test HTTP Anker Verwijzingen. Standaard is geen test. -d, --denyallow Verwissel de testvolgorde naar extern/intern. Standaard volgorde is intern/extern. -D, --debug Gebe zusätzliche Debug-Information aus. Geben Sie diese Option mehrere Male an, um noch mehr Debug-Informationen zu erhalten. -e regex, --extern=regex Behandle URLs welche diesen Ausdruck matchen als extern. Nur interne HTTP Links werden rekursiv geprüft. -f file, --config=file Benutze file als Konfigurationsdatei. Standardmäßig sucht LinkChecker zuerst /etc/linkcheckerrc und dann ~/.linkcheckerrc (unter Windows <Pfad-zum-Programm>\linkcheckerrc). -F type, --file-output=type Wie --output, aber schreibe in eine Datei (Standard ist linkchecker-out.<type>) Falls die Datei bereits existiert wird sie überschrieben. Sie können diese Option mehr als einmal verwenden. Es gibt keine Ausgabedatei für den blacklist Logger. Standard ist keine Ausgabe in eine Datei. -I, --interactive Frage nach URLs, falls keine auf der Kommandozeile eingegeben wurde. -i regex, --intern=regex Behandle URLs welche diese Ausdruck matchen als intern. -h, --help Hilf mir! Druche Nutzungsinformation für dieses Programm. -N, --nntp-server Gibt ein NNTP Rechner für 'news:...' Links. Standard ist die Umgebungsvariable NNTP_SERVER. Falls kein Rechner angegeben ist, wird lediglich auf korrekte Syntax des Links geprüft. -o type, --output=type Verwende die Ausgabe als %s. Standard Ausgabe ist text. -p pwd, --password=pwd Verwende das angegebene Passwort für HTTP und FTP Authorisation. Standard ist 'guest@'. Siehe -u. -P sek, --pause=sek Pausiere <sek> Sekunden zwischen dem Prüfen jeder URL. Diese Option impliziert -t0. Standard ist keine Pause zwischen dem Prüfen. --profile Write profiling data into a file named %s in the current working directory. See also --viewprof. -q, --quiet Keine Ausgabe. Dies ist nur in Verbindung mit -F nützlich. -r depth, --recursion-level=depth Prüfe rekursiv alle URLs bis zu der angegebenen Tiefe (depth >= 0). Standard Tiefe ist 1. -s, --strict Prüfe lediglich die Syntax von externen URLs. Es wird keine. Verbindung zu diesen Rechner aufgebaut. -t num, --threads=num Generiere nicht mehr als num Threads. Standard Anzahl von Threads ist 5. Um Threading auszuschalten geben Sie eine nichtpositive Anzahl an. --timeout=secs Setze den timeout für TCP Verbindungen in Sekunden. Der Standard timeout ist 10 Sekunden. -u name, --user=name Verwende den angegebenen Benutzernamen für HTTP und FTP Authorisation. Standard ist 'anonymous'. Siehe -p. -V, --version Drucke die Version und beende das Programm. -v, --verbose Logge alle geprüften URLs (impliziert -w). Standard ist es, nur fehlerhafte URLs zu loggen. --viewprof Print out previously generated profiling data. See also --profile. -w, --warnings Logge Warnungen. -W regex, --warning-regex=regex Definieren Sie einen regulären Ausdruck, der eine Warnung ausdruckt falls er den Inhalt einer geprüften URL matcht. Dies gilt natürlich nur für gültige Seiten deren Inhalt wir bekommen können. Sie können dies verwenden, um Seiten mit Fehlermeldungen wie z.B. 'Diese Seite ist umgezogen' oder 'Oracle Server Fehler'. Diese Option impliziert -w.

source: NOTES o LinkCheckers commandline parser treats "ftp." links like "ftp://ftp." and "www." links like "http://www.". You can also give local files as arguments. o If you have your system configured to automatically establish a connection to the internet (e.g. with diald), it will connect when checking links not pointing to your local host. Use the -s and -i options to prevent this. o Javascript links are currently ignored. o If your platform does not support threading, LinkChecker uses -t0. o You can supply multiple user/password pairs in a configuration file. o To use proxies set $http_proxy, $https_proxy, $ftp_proxy, $gopher_proxy on Unix or Windows. On a Mac use the Internet Config. o When checking 'news:' links the given NNTP host doesn't need to be the same as the host of the user browsing your pages!
nl: KOMMENTARE o LinkChecker's Kommandozeilenparser behandelt "ftp." Links wie "ftp://ftp." und "www." Links wie "http://www.". Sie können auch lokale Dateien als Argumente angeben o Falls sich Ihr System automatisch mit dem Internet verbindet (z.B. mit diald), wird es dies tun wenn Sie Links prüfen, die nicht auf Ihren lokalen Rechner verweisen Benutzen Sie die Optionen -s und -i um dies zu verhindern (siehe BEISPIELE) o Javascript Links werden zur Zeit ignoriert o Wenn Ihr System keine Threads unterstützt verwendet LinkChecker die Option -t0 o Sie können mehrere user/password Paare in einer Konfigurationsdatei angeben o Um Proxies zu benutzen, setzen Sie $http_proxy, $https_proxy unter Unix oder Windows. Auf einem Mac benutzen Sie die Internet Config. o Beim Prüfen von 'news:' Links muß der angegebene NNTP Rechner nicht unbedingt derselbe wie der des Benutzers sein!

source: EXAMPLES o linkchecker -v -ohtml -r2 -s -itreasure.calvinsplayground.de \ http://treasure.calvinsplayground.de/~calvin/ > sample.html o Local files and syntactic sugar on the command line: linkchecker c:\temp\test.html linkchecker ../bla.html linkchecker www.myhomepage.de linkchecker -r0 ftp.linux.org
nl: VOORBEELDEN o linkchecker -v -ohtml -r2 -s -itreasure.calvinsplayground.de \ http://treasure.calvinsplayground.de/~calvin/ > sample.html o Lokale bestanden en syntaktischer Zucker op de commandoregel: linkchecker c:\temp\test.html linkchecker ../bla.html linkchecker www.myhomepage.de linkchecker -r0 ftp.linux.org

source: Error: %s
nl: Fout: %s

source: Execute 'linkchecker -h' for help
nl: Voert u 'linkchecker -h' uit, om hulp te krijgen

source: Illegal argument '%s' for option
nl: Ongeldige parameter '%s' als option

source: enter one or more urls, separated by white-space -->
nl: voert u een of meer URLs in, gescheiden door spaties -->

source: no files or urls given
nl: geen bestanden of URLs gegeven

source: Hit RETURN to finish
nl: Toets RETURN om te beëindigen
